{
  "items": [
    {
      "text": "Roger offered us a meticulously planned programme based entirely on our needs and requirements having previously <strong>studied in-depth the full nature of our business to grasp a true understanding of what we strive do and achieve.</strong> From his research into search engine related elements (keywords, meta tags etc.) to the choice of images, typeface, style and colour themes, he made what is effectively a complex project into something entirely <strong>stress free</strong> for us. The final result feels entirely like a true reflection of us and what we offer and is many times more efficient and effective in capturing clients and generating new business.",
      "text2": "Basically put, Roger knows exactly what he is doing and our investment in his work has been more than fully justified for which I have no problems in <strong>recommending his services to anyone seriously looking to give their business a massive online boost!!</strong>",
      "photo": "giles-b-ski-instructor",
      "name": "Giles Birch",
      "organisation": "Sierra Essence/British Ski Center",
      "workpage": "/british-ski-center-sierra-essence/"
    },
    {
      "text": "I would highly recommend Roger. Roger initially created for us a simple yet attractive e-commerce website which worked perfectly and fit our budgets. As our business has grown, Roger has been instrumental in developing our website. Roger also prepared a detailed report on how we could <strong>improve SEO for our website</strong>. The result has been <strong>a significant increase in our organic web traffic</strong>. Roger also responds to our requests really quickly which I really appreciate - it helps me feel that <strong>we are truly supported and protected</strong> from an IT point of view.",
      "photo": "julie-macken-neves-bees",
      "name": "Julie Macken",
      "organisation": "Neve's Bees",
      "workpage": "/neves-bees2/"
    },
    {
      "text": "Roger really helped me to establish my business branding and developed a fresh new website. As a relatively new business I had little content to work with and encouraged a different approach to overcome this. Roger developed <strong>a fantastic new site within a fixed budget</strong>, taking on all the technical migration aspects from my old to new site.",
      "photo": "ian-shirvell-architectural-technician",
      "name": "Ian Shirvell",
      "organisation": "Ora Design Architecture",
      "workpage": "/ora-design-architecture/"
    },
    {
      "text": "Roger built me an excellent and robust portfolio-style website; and I think the value of his process came into force with his <strong>precision and attention to detail</strong>. Plus his website maintenance offering is prompt, efficient and transparent. <strong>A great developer to work with.</strong>",
      "photo": "emma-roebuck-ox-designers",
      "name": "Emma Roebuck",
      "organisation": "Ox Designers",
      "workpage": "/oxdesigners/"
    },
    {
      "text": "I recently used AttractMore for some technical work that I needed done to my site, and working with Roger was a total pleasure. He was incredibly efficient, and he identified other technical elements of my site that I could work on to boost SEO that I wasn't aware of. He's friendly and highly capable, and <strong>I'd recommend working with AttractMore to anyone</strong>, whether you only need technical tweaks or are looking for someone to build an entirely new, optimised website.",
      "photo": "katie-uniacke",
      "name": "Katie Uniacke",
      "organisation": "Translator & Copywriter"
    },
    {
      "text": "Thank you for all of your sterling efforts.  I TRULY TOTALLY couldn't have done it without you and really didn't anticipate how much my business would grow as a result of the website. <strong>My business has grown much more than I had envisaged and this is entirely down to the quality of the website and the SEO</strong>.  All down to you.",
      "photo": "alison-plant-pilates-leeds",
      "name": "Alison Plant",
      "organisation": "Pilates Leeds",
      "workpage": "/pilates-leeds/"
    },
    {
      "text": "I was very impressed with the cost effective proposals offered for the creation of a new Japlene website. Working with AttractMore was a pleasure and we were kept in the picture throughout development and acquisition. I was extremely pleased with the completed website and have instruction manuals for simple updates.",
      "photo": "polly-japlene-oxford",
      "name": "Polly Hyde",
      "organisation": "Japlene, Oxford"
    }
  ]
}
